#!/bin/bash
set -e

do_6_1() {
    case "$2" in
        "57")
            echo "执行 6.1.57 热修复补丁..."
            ;;
        "75")
            echo "执行 6.1.75 热修复补丁..."
            ;;
        "115")
            echo "执行 6.1.115 (天玑系)热修复补丁..."
            ;;
        "118")
            echo "执行 6.1.118 热修复补丁..."
            ;;
        "128")
            echo "执行 6.1.128 (天玑系)热修复补丁..."
            ;;
        "134")
            echo "执行 6.1.134 (天玑系)热修复补丁..."
            ;;
        "all")
            echo "执行 6.1 系列通用热修复补丁..."
            ;;
        *)
            echo "无效的sublevel，已自动跳过脚本执行！"
            exit 0
            ;;
    esac
}

do_6_6() {
    case "$2" in
        "30")
            echo "执行 6.6.30 热修复补丁..."
            ;;
        "50")
            echo "执行 6.6.50 热修复补丁..."
            ;;
        "56")
            echo "执行 6.6.56 热修复补丁..."
            ;;
        "57")
            echo "执行 6.6.57 热修复补丁..."
            ;;
        "66")
            echo "执行 6.6.66 热修复补丁..."
            ;;
        "89")
            echo "执行 6.6.89 热修复补丁..."
            ;;
        "89_mtk")
            echo "执行 6.6.89 (天玑系)热修复补丁..."
            ;;
        "all")
            echo "执行 6.6 系列通用热修复补丁..."
            ;;
        *)
            echo "无效的sublevel，已自动跳过脚本执行！"
            exit 0
            ;;
    esac
}

do_6_12() {
    case "$2" in
        "23")
            echo "执行 6.12.23 热修复补丁..."
            ;;
        "23_mtk")
            echo "执行 6.12.23 (天玑系)热修复补丁..."
            ;;
        "38")
            echo "执行 6.12.38 热修复补丁..."
            ;;
        "all")
            echo "执行 6.12 系列通用热修复补丁..."
            ;;
        *)
            echo "无效的sublevel，已自动跳过脚本执行！"
            exit 0
            ;;
    esac
}

case "$1" in
    "6.1")
        do_6_1 "$@"
        ;;
    "6.6")
        do_6_6 "$@"
        ;;
    "6.12")
        do_6_12 "$@"
        ;;
    *)
        echo "无效的传入值，已自动跳过脚本执行！"
        echo "用法：$0 {6.1|6.6|6.12} [SUBLEVEL]"
        exit 0
        ;;
esac
